{
  "_class_name": "UNet2DConditionModel",
  "_diffusers_version": "0.6.0",
  "act_fn": "silu",
  "attention_head_dim": 8,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "center_input_sample": false,
  "cross_attention_dim": 768,
  "down_block_types": [
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "DownBlock2D"
  ],
  "downsample_padding": 1,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 4,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "out_channels": 4,
  "sample_size": 64,
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D"
  ],
  "mid_block_type":"UNetMidBlock2DCrossAttn",
  "mid_block_only_cross_attention": null,
  "encoder_hid_dim": null,
  "addition_embed_type_num_heads": 64,
  "transformer_layers_per_block": 1,
  "conv_out_kernel": 3,
  "dropout": 0.0,
  "resnet_out_scale_factor": 1.0,
  "resnet_time_scale_shift": "default",
  "encoder_hid_dim_type": null,
  "upcast_attention": false,
  "addition_time_embed_dim": null,
  "num_class_embeds": null,
  "cross_attention_norm": null,
  "reverse_transformer_layers_per_block": null,
  "time_embedding_type": "positional",
  "projection_class_embeddings_input_dim": null,
  "resnet_skip_time_act": false,
  "num_attention_heads": null,
  "timestep_post_act": null,
  "attention_type": "default",
  "class_embeddings_concat": false,
  "use_linear_projection": false,
  "time_cond_proj_dim": null,
  "time_embedding_dim": null,
  "addition_embed_type": null,
  "only_cross_attention": false,
  "dual_cross_attention": false,
  "time_embedding_act_fn": null,
  "class_embed_type": null,
  "conv_in_kernel": 3
}
